[
  {
    "title": "Article 1（Scope of Application)",
    "content": [
      {
        "content_LV1": "These Terms and Conditions shall govern any accommodation agreements or any other related contracts entered into between the hotel and the guest（including daytime guests using rooms for teleworking, etc.; the same shall apply hereinafter）, and any matters not stipulated in the Terms and Conditions shall be governed by law and generally established customs.",
        "content_LV2": []
      },
      {
        "content_LV1": "Any usage guidelines and precautions（hereinafter collectively referred to as “Rules”）presented by the hotel in connection with these Terms and Conditions shall, in addition to the Hotel Rules and Regulations established by the hotel and kept in guestrooms, constitute a part of these Terms and Conditions.",
        "content_LV2": []
      },
      {
        "content_LV1": "Notwithstanding the preceding paragraph, any special agreements provided by the hotel within the scope permitted by law and customs shall take precedence.",
        "content_LV2": []
      }
    ]
  },
  {
    "title": "Article 2（Application for an Accommodation Agreement",
    "content": [
      {
        "content_LV1": "Those applying for an accommodation agreement at the hotel shall provide the hotel with the following information.",
        "content_LV2": [
          "Guest name and telephone number.",
          "The date of stay and estimated time of arrival.",
          "Accommodation fees（generally based on the Basic Accommodation Fees in Appendix 1.",
          "Other information the hotel deems necessary"
        ]
      },
      {
        "content_LV1": "In the event that a guest requests to extend their stay beyond the date listed in（2）of the preceding paragraph, an application for a new accommodation agreement is deemed to have been made at the time the request was made.",
        "content_LV2": []
      }
    ]
  },
  {
    "title": "Article 3（Establishment of the Accommodation Agreement）",
    "content": [
      {
        "content_LV1": "The accommodation agreement shall be established when the hotel accepts the application set forth in the preceding paragraph. However, this does not apply when the hotel proves it has not accepted the application.",
        "content_LV2": []
      },
      {
        "content_LV1": "When an accommodation agreement has been established as per the provisions of the preceding paragraph, the guest must pay a deposit set by the hotel by the deadline designated by the hotel.",
        "content_LV2": []
      },
      {
        "content_LV1": "The deposit shall first be allocated to room charges ultimately payable by the guest, then allocated to fines followed by compensation for damages in the event that the provisions of Articles 6 and 21 apply; any remaining deposit shall be returned at the time of payment in accordance with Article 13.",
        "content_LV2": []
      },
      {
        "content_LV1": "The accommodation agreement shall cease to be effective when the guest fails to pay the deposit set forth in Paragraph 2 by the deadline designated by the hotel. However, this is limited to cases in which the hotel notifies guests of a deposit deadline.",
        "content_LV2": []
      }
    ]
  },
  {
    "title": "Article 4（Special Agreements Not Requiring a Deposit）",
    "content": [
      {
        "content_LV1": "Notwithstanding the provisions of Paragraph 2 of the preceding article, the hotel may accept special agreements that do not require payment of a deposit.",
        "content_LV2": []
      },
      {
        "content_LV1": "The preceding paragraph on special agreements shall apply when the hotel does not request payment of the deposit set forth in Paragraph 2 of the preceding article or does not specify a deposit payment deadline when accepting applications for an accommodation agreement.",
        "content_LV2": []
      }
    ]
  },
  {
    "title": "Article 5（Refusal of Accommodation Agreements）",
    "content": [
      {
        "content_LV1": "This hotel may refuse to enter into an accommodation agreement in the following cases:",
        "content_LV2": [
          "When the accommodation application violates the stipulations of these Terms and Conditions",
          "When guestrooms are fully booked",
          "When a potential guest is deemed likely to break the law, disrupt public order, or act contrary to public morals during their stay.",
          "When the potential guest’s behavior poses a significant nuisance to other guests.",
          "When the potential guest clearly has a contagious disease.",
          "When the potential guest uses violence, threats, blackmail, or intimidation to make unjust or unreasonable demands against the hotel or its employees, or is deemed to have engaged in any similar acts in the past.",
          "When the hotel is unable to accommodate guests due to natural disaster, facility malfunction, or other inevitable circumstances.",
          "When the potential guest is intoxicated, exhibits or has exhibited extremely abnormal behavior that may pose a nuisance to other guests, or in cases that fall under the provisions of prefectural ordinances.",
          "When the potential guest is extremely unsanitary or is wearing extremely dirty clothes that may cause a nuisance to other guests.",
          "When the potential guest conceals the fact that they have reserved a guestroom within the hotel for the purpose of making a profit, either for themselves or for a third party, by selling goods, etc.",
          "When the potential guest does not comply with these Terms and Conditions or with cancellation and payment policies when making a reservation."
        ]
      }
    ]
  },
  {
    "title": "Article 6（The Guest’s Right to Terminate the Accommodation Agreement）",
    "content": [
      {
        "content_LV1": "Guests may request that the hotel terminate the accommodation agreement.",
        "content_LV2": []
      },
      {
        "content_LV1": "If the accommodation agreement is terminated in full or in part for reasons attributable to the guest, the hotel shall charge a penalty in accordance with the provisions of Attached Table 2 （only in cases where the hotel specifies a deposit payment deadline and requests payment as stipulated in Article 3（2）and excludes cases in which the guest cancels the accommodation agreement prior to such payment）. However, in the event that the hotel accepts a special agreement as stipulated in Article 4（1）, guests are only required to pay a penalty for terminating the accommodation agreement when they have been notified of this obligation.",
        "content_LV2": []
      },
      {
        "content_LV1": "If the guest does not arrive by 10 pm or two hours after a scheduled arrival time arranged in advance on the day of their stay without contacting the hotel, the accommodation agreement may be deemed to have been terminated by the guest.",
        "content_LV2": []
      }
    ]
  },
  {
    "title": "Article 7（The Hotel’s Right to Terminate the Accommodation Agreement）",
    "content": [
      {
        "content_LV1": "The hotel may terminate the accommodation agreement in the following cases",
        "content_LV2": [
          "When the guest is deemed likely to break the law, disrupt public order, or act contrary to public morals, or has engaged in such acts, during their stay.",
          "When the guest’s behavior poses a significant nuisance to other guests."
        ]
      },
      {
        "content_LV1": "When the hotel cancels the accommodation agreement in accordance with the provisions of the preceding paragraph, the guest will not be charged for services not yet provided.",
        "content_LV2": []
      }
    ]
  },
  {
    "title": "Article 8（Guest Registration）",
    "content": [
      {
        "content_LV1": "Guests must register the following information at the front desk on the day of their stay.",
        "content_LV2": [
          "Guest name, age, gender, address, contact telephone number, and occupation",
          "eparture date and planned departure time",
          "Other information deemed necessary by the hotel"
        ]
      },
      {
        "content_LV1": "International guests who do not have an address in Japan are required to present a scan or copy of their passport and register their nationality, passport number, port of entry, and immigration date in addition to the information listed above.",
        "content_LV2": []
      },
      {
        "content_LV1": "Guests who wish to pay the fees stipulated in Article 13 using traveler’s checks, hotel vouchers, credit cards, or any other alternative for currency must present this in advance when registering the information above. Be aware currency payment will not be accepted if the hotel has notified the guest in advance that currency is not accepted.",
        "content_LV2": []
      }
    ]
  },
  {
    "title": "Article 9（Guestroom Hours）",
    "content": [
      {
        "content_LV1": "Guestrooms may be used from 3 pm to 11 am the following day. However, for extended stays, guests may use the guestroom for the entire day excluding arrival and departure dates.",
        "content_LV2": []
      },
      {
        "content_LV1": "Notwithstanding the provisions of the preceding paragraph, the hotel may allow guests to use guestrooms outside the hours specified above. In doing so, the following extension fees will be charged:",
        "content_LV2": [
          "Until 2:00 pm: ¥1,000 per hour per guestroom",
          "After 2:00 pm: Full room rate"
        ]
      }
    ]
  },
  {
    "title": "Article 10（Compliance with the Hotel Rules and Regulations）",
    "content": [
      {
        "content_LV1": "Guests shall comply with these Terms and Conditions as well as Rules while staying at the hotel.",
        "content_LV2": []
      }
    ]
  }
]
